Австралия/src/AccumulationRegisters/GoodsConsumedToDeclare/GoodsConsumedToDeclare.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>GoodsConsumedToDeclare</name>
  <resources>
    <name>Quantity</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ContentOfAccountingRecord</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Products</name>
    <type>
      <types>CatalogRef.Products</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Characteristic</name>
    <type>
      <types>CatalogRef.ProductsCharacteristics</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Batch</name>
    <type>
      <types>CatalogRef.ProductsBatches</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Counterparty</name>
    <type>
      <types>CatalogRef.Counterparties</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Австралия/src/AccumulationRegisters/GoodsConsumedToDeclare/ManagerModule.bsl
#If Server Or ThickClientOrdinaryApplication Or ExternalConnection Then

#Region ProgramInterface

// Procedure creates an empty temporary table of records change.
//
Procedure CreateEmptyTemporaryTableChange(AdditionalProperties) Export
	
	If Not AdditionalProperties.Property("ForPosting")
	 OR Not AdditionalProperties.ForPosting.Property("StructureTemporaryTables") Then
		Return;
	EndIf;
	
	StructureTemporaryTables = AdditionalProperties.ForPosting.StructureTemporaryTables;
	
	Query = New Query(
	"SELECT TOP 0
	|	GoodsConsumedToDeclare.LineNumber AS LineNumber,
	|	GoodsConsumedToDeclare.Company AS Company,
	|	GoodsConsumedToDeclare.Products AS Products,
	|	GoodsConsumedToDeclare.Characteristic AS Characteristic,
	|	GoodsConsumedToDeclare.Batch AS Batch,
	|	GoodsConsumedToDeclare.Counterparty AS Counterparty,
	|	GoodsConsumedToDeclare.Quantity AS QuantityBeforeWrite,
	|	GoodsConsumedToDeclare.Quantity AS QuantityChange,
	|	GoodsConsumedToDeclare.Quantity AS QuantityOnWrite
	|INTO RegisterRecordsGoodsConsumedToDeclareChange
	|FROM
	|	AccumulationRegister.GoodsConsumedToDeclare AS GoodsConsumedToDeclare");
	
	Query.TempTablesManager = StructureTemporaryTables.TempTablesManager;
	QueryResult = Query.Execute();
	
	StructureTemporaryTables.Insert("RegisterRecordsGoodsConsumedToDeclareChange", False);
	
EndProcedure

#EndRegion

#EndIf
